app/controllers/plans_controller.rb

  def index

    @q = Plan.search(params[:q])
    @plans = @q.result(distinct: true).paginate(:page => params[:page], :per_page => 10)
---
SELECT "plans".* FROM "plans"
SELECT DISTINCT "plans".* FROM "plans"

  def show
    @plan = Plan.find(params[:id])
---
SELECT "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    authorize! :edit, @user, :message => 'Not authorized as an administrator.'
    @plan = Plan.find(params[:id])
---
SELECT "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", "6"]]

  def create
    authorize! :create, @user, :message => 'Not authorized as an administrator.'
    @plan = Plan.new(params[:plan])

    respond_to do |format|
      if @plan.save
---
INSERT INTO "plans" ("bathrooms", "bedrooms", "created_at", "dining", "drawing_1_content_type", "drawing_1_file_name", "drawing_1_file_size", "drawing_1_updated_at", "drawing_2_content_type", "drawing_2_file_name", "drawing_2_file_size", "drawing_2_updated_at", "elevation_content_type", "elevation_file_name", "elevation_file_size", "elevation_updated_at", "half_bath", "levels", "living", "name", "price", "sqfoot", "stories", "suite", "updated_at", "view") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    authorize! :update, @user, :message => 'Not authorized as an administrator.'
    @plan = Plan.find(params[:id])

    respond_to do |format|
      if @plan.update_attributes(params[:plan])
---
SELECT "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "plans" SET "bedrooms" = 4, "sqfoot" = 5444, "levels" = 2, "bathrooms" = 2, "price" = 22222.0, "drawing_1_file_name" = 'A-1.1.pdf', "drawing_1_file_size" = 311788, "drawing_1_updated_at" = '2013-10-01 21:50:33.574135', "updated_at" = '2013-10-01 21:50:38.429047' WHERE "plans"."id" = 7

  def destroy
    authorize! :destroy, @user, :message => 'Not authorized as an administrator.'
    @plan = Plan.find(params[:id])
    @plan.destroy
---
SELECT "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "plans" WHERE "plans"."id" = ?  [["id", 4]]